//240417_2030_glory
- 자바스크립트 개발자가 가져야할 DNS와 HTTP 같은 기초적인 백엔드 지식 제공 예정
- Nodejs, 전통의 강자 express, NestJS, db활용, 인증, 비동기 처리, 웹소켓 전송 설명예정
- 자바, 코틀린의 Spring, 파이썬의 장고 or 플라스크, Go lang의 GIN, C#의 .NET Framework, Javascript의 Node.JS(express, NestJS)중 Node 위주로 설명 예정
- image 참고

//240418_0936_glory
- JavaScript의 백엔드 환경은 Node.JS이다.
- 객치지향으로 제공하는건 타입스크립트이다.
- NodeJS의 프레임 워크로 express를 활용했지만 최근에는 NestJS를 채택한다.
- 둘다 할줄 알아야 하므로 이를 설명하고자 한다.

타입스크립트는?
- 타입스크립트는 자바스크립트를 기반으로 정적타입 문법을 추가한 프로그래밍 언어이다.
- es6를 기반으로 한 새로운 문법을 제공하며, 자바스크립트와 완벽히 호환된다.

NodeJS는?
- 서버단에서 자바스크립트를 실행시킬수 있는 자바스크립트 런타임입니다.
- 프론트랑도 같은 코드이며, 생태계 구축이 잘 되어있다.

- 익스프레스는 NodeJS에서 가장 많이 사용되는 웹프레임워크입니다.
- 미니멀 리스트 프레임워크를 지향하고 있다.
- 확장하기에도 용이한 구조로 되어있다.
- NestJS 자바스크립트 최신기술을 적용해 생산성 있는 웹 어플리케이션을 빠르고 안정적으로 만들수 있게 해주는 웹 프레임 워크입니다.





















